app/controllers/records_controller.rb

  def index
    @records = Record.all
---
SELECT `records`.* FROM `records`

  def search
    @records = Record.search(params[:record][:name])
---
SELECT `records`.* FROM `records` WHERE (name LIKE '%o%')

  def create
    @record = Record.new(params[:record])
    if @record.save
---
INSERT INTO `records` (`comments`, `created_at`, `name`, `updated_at`) VALUES ('Ocorre durante o serviço.', '2013-01-04 18:47:38', 'Ocorrecia de serviço', '2013-01-04 18:47:38')

  def edit
    @record = Record.find_by_id(params[:id])
---
SELECT `records`.* FROM `records` WHERE `records`.`id` = 1 LIMIT 1