app/controllers/type_two_users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`type` IN ('TypeTwoUser')
---
  def index
    @type_two_users = TypeTwoUser.all

INSERT INTO `users` (`birthdate`, `cpf`, `created_at`, `crypted_password`, `email`, `name`, `remember_me_token`, `remember_me_token_expires_at`, `reset_password_email_sent_at`, `reset_password_token`, `reset_password_token_expires_at`, `rg`, `salt`, `type`, `updated_at`, `username`) VALUES ('1986-08-04', '39208032809', '2013-01-04 18:46:01', NULL, 'maria@email.com', 'Maria das Dores', NULL, NULL, NULL, NULL, NULL, '82783739', NULL, 'TypeTwoUser', '2013-01-04 18:46:01', 'maria')
---
  def create
    @type_two_user = TypeTwoUser.new(params[:type_two_user])
    if @type_two_user.save

SELECT `users`.* FROM `users` WHERE `users`.`type` IN ('TypeTwoUser') AND `users`.`id` = 3 LIMIT 1
---
  def show
    @type_two_user = TypeTwoUser.find_by_id(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`type` IN ('TypeTwoUser') AND `users`.`id` = 3 LIMIT 1
---
  def edit
    @type_two_user = TypeTwoUser.find_by_id(params[:id])