app/controllers/type_one_users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`type` IN ('TypeOneUser')
---
  def index
    @type_one_users = TypeOneUser.all

INSERT INTO `users` (`birthdate`, `cpf`, `created_at`, `crypted_password`, `email`, `name`, `remember_me_token`, `remember_me_token_expires_at`, `reset_password_email_sent_at`, `reset_password_token`, `reset_password_token_expires_at`, `rg`, `salt`, `type`, `updated_at`, `username`) VALUES ('1962-01-18', '39208032809', '2013-01-04 18:44:30', NULL, 'joao@email.com', 'João do Galo', NULL, NULL, NULL, NULL, NULL, '37883904', NULL, 'TypeOneUser', '2013-01-04 18:44:30', 'joao')
---
  def create
    @type_one_user = TypeOneUser.new(params[:type_one_user])
    if @type_one_user.save